#elm-repl : REPL（対話環境）


対話環境というツールです。一行づつソースコードをコンパイルして結果や型などを表示してくれます。
ちょっと構文や動作を確認したい時や、型がどうなっているか知りたい時に便利です。

##起動コマンド

elm repl / elm-repl

```bash
elm-repl
```

##使い方

###eval

式、関数を入力して改行すると、計算して結果を表示します。
また結果の型も表示します。

```elm
> 1 + 1
2 : number
```

変数を定義してみます。

```elm
> x = 10
10 : number
> x + 2
12 : number
```

関数を定義してみます。

```elm
> add10 x = x + 10
<function> : number -> number
> add10 5
15 : number
```

関数の型も表示します。

Elmの構文については->構文へ
なにかエラーが表示されたら->よくみるエラーへ  

###外部のモジュールを読み込む

外部のモジュールを読み込んで、使うことが出来ます。

```elm
> import List
```

```elm
> List.map ((+) 2) [1..5]
[3,4,5,6,7] : List number
```

###改行する

改行するには`\`(バックスラッシュ)を打ってエンターキーを押します。

```elm
> let x = 10 \
|     y = 3  \
| in x * y
30 : number
```

###終了

replを終了するには、:exitコマンドです。

```elm
:exit
```

##REPL内で使えるコマンド

:help
:exit
